Public Member Functions | List of all members
API_IGraphisoftIDEventHandler Class Referenceabstract
Notifications Manager
#include <APIdefs_Callback.h>
 Inheritance diagram for API_IGraphisoftIDEventHandler:
 Public Member Functions
virtual GS::UniString  | GetName () const override final
virtual void  | Dispatch (const API_IEventNotifier &eventNotfier) const override final
virtual void  | OnUserChanged () const =0
 Public Member Functions inherited from API_IEventHandler
virtual  | ~API_IEventHandler ()=default
virtual GS::UniString  | GetName () const =0
virtual void  | Dispatch (const API_IEventNotifier &eventNotfier) const =0
Detailed Description
The base class you need to inherit from in case you want to handle Graphisoft ID change event.
Since
Archicad 26
Member Function Documentation
◆ Dispatch()
 virtual void API_IGraphisoftIDEventHandler::Dispatch  |  ( |  const API_IEventNotifier &  |  eventNotfier | ) |   const
inlinefinaloverridevirtual
Implements API_IEventHandler.
◆ GetName()
 virtual GS::UniString API_IGraphisoftIDEventHandler::GetName  |  ( |   | ) |   const
inlinefinaloverridevirtual
Implements API_IEventHandler.
◆ OnUserChanged()
 virtual void API_IGraphisoftIDEventHandler::OnUserChanged  |  ( |   | ) |   const
pure virtual